11/data/attachments/3393126f5c0b58d3.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_9f3692d2-b0b2-4737-bae9-628b470a21ee</nif:username>
            <nif:friendToBeAdded>Bryce_kitchen_Friend_52698_8</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>